import requests
from telebot import types
from telebot.types import InlineKeyboardMarkup, InlineKeyboardButton
token="5256652879:AAEg8WdI6D1-zJGUlsOGnYZ4kY-ZidQ3cy4"
admins=[1639410915]
button1='Сегодня'
button2='Завтра'
button3='📆 Всё расписание'
button4='📝 Доп. возможности'
nazad='🔙 Назад'
btn1='⏰ Поставить будильник'
btn2='📝 Сделать заметку'
btn3='🎓 Изменить кафедру'
btn4='📝 Мои заметки'
def perv_para(day, raspis, chis):
    timer=["",510,615,720,830,940,1045,1150]
    timerFV=["","",600,740,845,950]
    if day==7:
        return "Воскресенье, отдыхайте"
    else:
        if day==8:
            day=1
            chis=abs(chis-1)
        raspis=raspis[1]
        ras=0
        for i in raspis:
            if i[0]==day:
                for i2 in i[1]:
                    if len(i2[1])>1:
                        for i3 in i2[1]:
                            if chis==0 and i3[0]=="Знаменатель":
                                if "Элективный курс" in i3[1]:
                                    ras= timerFV[i2[0]]                                   
                                else:
                                    ras= timer[i2[0]]
                                break
                            elif chis==1 and i3[0]=='Числитель':
                                if "Элективный курс" in i3[1]:
                                    ras= timerFV[i2[0]]                                   
                                else:
                                    ras= timer[i2[0]]
                                break
                    else:
                        if chis==0 and i2[1][0][0]=="Знаменатель":
                            if "Элективный курс" in i2[1][0][1]:        
                                ras= timerFV[i2[0]]                             
                            else:                        
                                ras= timer[i2[0]]
                            break
                        elif chis==1 and i2[1][0][0]=="Числитель":
                            if "Элективный курс" in i2[1][0][1]:        
                                ras= timerFV[i2[0]]                             
                            else:                        
                                ras= timer[i2[0]]
                            break
                        elif i2[1][0][0]=="Оба дня":
                            if "Элективный курс" in i2[1][0][1]:        
                                ras= timerFV[i2[0]]                           
                            else:                        
                                ras= timer[i2[0]]
                            break
                if ras!=0:
                    break
    return ras    

def chisa(): 
    a=requests.get('https://lks.bmstu.ru/schedule/list')
    b=a.content.decode('utf-8')
    b=b.replace(" ","",b.count(" "))
    b=b.split("\n")
    c=[]
    for i in range(len(b)):
        if 'ahref="' in b[i]:
            d=b[i].split('"')
            c.append([b[i+1],d[1]])
    pras=[]
    for i in range(len(c)):
        if not "<" in c[i][0]:
            a=requests.get('https://lks.bmstu.ru'+c[i][1])
            b=a.content.decode('utf-8')
            if "числитель" in b:
                return int(1)
            elif "знаменатель" in b:
                return int(0)

def pars(parametr):
    if parametr=="ИУ5-55Б":
        return ['ИУ5-55Б', [[1, [[1, [['Числитель', 'ВС 1/2 306э']]], [6, [['Знаменатель', 'Пр-ка 903']]], [7, [['Знаменатель', 'Пр-ка 903']]]]], [2, [[4, [['Оба дня', '(сем) Элективный курс по физической культуре и спорту   ']]], [5, [['Оба дня', '(сем) Иностранный язык каф. Л2  ']]], [6, [['Оба дня', '(лек) Операционные системы 515ю Семкин П. С. ']]], [7, [['Оба дня', '(лек) Разработка интернет-приложений 515ю Канев А. И. ']]]]], [3, [[3, [['Оба дня', 'Самостоятельная работа   ']]]]], [4, [[2, [['Оба дня', '(лек) Сети и телекоммуникации 515ю Галкин В. А. ']]], [3, [['Числитель', '(лек) Сети и телекоммуникации 515ю Галкин В. А. '], ['Знаменатель', '(лек) Теория управления 515ю Лукьянов В. В. ']]], [4, [['Оба дня', '(лек) Теория управления 515ю Лукьянов В. В. ']]], [5, [['Оба дня', '(сем) Элективный курс по физической культуре и спорту   ']]]]], [5, [[1, [['Знаменатель', '(лек) Вычислительные средства АСОИУ 524 Спиридонов С. Б. ']]], [2, [['Оба дня', '(лек) Вычислительные средства АСОИУ 524 Спиридонов С. Б. ']]], [3, [['Оба дня', '(лек) Оперативный анализ данных 524 Маслеников К. Ю., Селиверстова А. В. ']]],[4,[['Оба дня','лр ВС 2/2 306э']]]]], [6, [[1, [['Числитель', 'ОАД лр 306э']]],[2, [['Числитель', 'ОАД лр 306э'],['Знаменатель', 'СТ лр 306э']]],[3, [['Числитель', 'ОС лр 903'],['Знаменатель', 'СТ лр 306э']]],[4, [['Числитель', 'ОС лр 903'],['Знаменатель', 'РИП лр 306э']]],[5, [['Знаменатель', 'РИП лр 306э']]]]]]]
    elif parametr=="ИУ5-54Б":
        return ['ИУ5-54Б', [[1, [[4, [['Числитель', 'РИП 1/2 306э']]], [5, [['Числитель', 'РИП 1/2 306э']]], [6, [['Числитель', 'Пр-ка 903'],['Знаменатель', 'СТ 1/2 306э']]], [7, [['Числитель', 'Пр-ка 903'],['Знаменатель', 'СТ 1/2 306э']]]]], [2, [[5, [['Оба дня', '(сем) Элективный курс по физической культуре и спорту   ']]],  [6, [['Оба дня', '(лек) Операционные системы 515ю Семкин П. С. ']]], [7, [['Оба дня', '(лек) Разработка интернет-приложений 515ю Канев А. И. ']]]]], [3, [[1, [['Числитель', 'РИП 2/2 306э']]],[2, [['Числитель', 'РИП 2/2 306э']]],[3, [['Числитель', 'СТ 2/2 306э']]],[5, [['Знаменатель', 'СТ 2/2 306э']]],[6, [['Знаменатель', 'ВС 2/2 306э']]],[7, [['Знаменатель', 'ВС 2/2 306э']]] ]], [4, [[1, [['Оба дня', '(сем) Иностранный язык каф. Л2  ']]],[2, [['Оба дня', '(лек) Сети и телекоммуникации 515ю Галкин В. А. ']]], [3, [['Числитель', '(лек) Сети и телекоммуникации 515ю Галкин В. А. '], ['Знаменатель', '(лек) Теория управления 515ю Лукьянов В. В. ']]], [4, [['Оба дня', '(лек) Теория управления 515ю Лукьянов В. В. ']]]]], [5, [[1, [['Числитель', 'ОАД лр 362'],['Знаменатель', '(лек) Вычислительные средства АСОИУ 524 Спиридонов С. Б. ']]], [2, [['Оба дня', '(лек) Вычислительные средства АСОИУ 524 Спиридонов С. Б. ']]], [3, [['Оба дня', '(лек) Оперативный анализ данных 524 Маслеников К. Ю., Селиверстова А. В. ']]],[4,[['Оба дня','(сем) Элективный курс по физической культуре и спорту   ']]]]], [6, [[1, [['Числитель', 'ВС 1/2 306э'],['Знаменатель', 'ОС лр 903']]],[2, [['Числитель', 'ВС 1/2 306э'],['Знаменатель', 'ОС лр 903']]],[3, [['Знаменатель', 'ОАД лр 306э']]]]]]]    
    elif parametr=="ИУ5-53Б":
        return ['ИУ5-53Б', [[1, [[4, [['Числитель', 'РИП 1/2 306э'],['Знаменатель', 'Пр-ка 903']]], [5, [['Числитель', 'РИП 1/2 306э'],['Знаменатель', 'Пр-ка 903']]], [6, [['Числитель', 'СТ 1/2 306э']], [7, [['Числитель', 'СТ 1/2 306э']]]]]], [2, [[6, [['Оба дня', '(лек) Операционные системы 515ю Семкин П. С. ']]], [7, [['Оба дня', '(лек) Разработка интернет-приложений 515ю Канев А. И. ']]]]], [3, [[1, [['Числитель', 'РИП 2/2 306э']]],[2, [['Числитель', 'РИП 2/2 306э']]],[3, [['Числитель', 'СТ 2/2 306э']]],[5, [['Знаменатель', 'СТ 2/2 306э']]],[6, [['Знаменатель', 'ВС 2/2 306э']]],[7, [['Знаменатель', 'ВС 2/2 306э']]] ]], [4, [[2, [['Оба дня', '(лек) Сети и телекоммуникации 515ю Галкин В. А. ']]], [3, [['Числитель', '(лек) Сети и телекоммуникации 515ю Галкин В. А. '], ['Знаменатель', '(лек) Теория управления 515ю Лукьянов В. В. ']]], [4, [['Оба дня', '(лек) Теория управления 515ю Лукьянов В. В. ']]], [5, [['Оба дня', '(сем) Элективный курс по физической культуре и спорту   ']]]]], [5, [[1, [['Знаменатель', '(лек) Вычислительные средства АСОИУ 524 Спиридонов С. Б. ']]], [2, [['Оба дня', '(лек) Вычислительные средства АСОИУ 524 Спиридонов С. Б. ']]], [3, [['Оба дня', '(лек) Оперативный анализ данных 524 Селиверстова А. В., Маслеников К. Ю. ']]], [4, [['Оба дня', '(сем) Иностранный язык 235л, 401л  ']]], [5, [['Оба дня', '(сем) Элективный курс по физической культуре и спорту   ']]]]], [6, [[1, [['Числитель', 'ВС 1/2 306э'],['Знаменатель', 'ОАД лр 306э']]],[2, [['Числитель', 'ВС 1/2 306э'],['Знаменатель', 'ОАД лр 306э']]],[3, [['Знаменатель', 'ОС лр 903']]],[4, [['Знаменатель', 'ОС лр 903']]]]]]]
    elif parametr=="ИУ5-52Б":
        return ['ИУ5-52Б', [[1, [[4, [['Числитель', 'Пр-ка 903'],['Знаменатель', 'РИП 1/2 306э']]], [5, [['Числитель', 'Пр-ка 903'],['Знаменатель', 'РИП 1/2 306э']]], [6, [['Числитель', 'СТ 1/2 306э']]], [7, [['Числитель', 'СТ 1/2 306э']]]]], [2, [[4, [['Оба дня', '(сем) Элективный курс по физической культуре и спорту   ']]], [5, [['Оба дня', '(сем) Иностранный язык 235л, 401л  ']]], [6, [['Оба дня', '(лек) Операционные системы 515ю Семкин П. С. ']]], [7, [['Оба дня', '(лек) Разработка интернет-приложений 515ю Канев А. И. ']]]]], [3, [[1, [['Знаменатель', 'РИП 2/2 306э']]],[2, [['Знаменатель', 'РИП 2/2 306э']]],[3, [['Знаменатель', 'СТ 2/2 306э']]],[5, [['Числитель', 'СТ 2/2 306э']]],[6, [['Числитель', 'ВС 2/2 306э']]],[7, [['Числитель', 'ВС 2/2 306э']]] ]], [4, [[2, [['Оба дня', '(лек) Сети и телекоммуникации 515ю Галкин В. А. ']]], [3, [['Числитель', '(лек) Сети и телекоммуникации 515ю Галкин В. А. '], ['Знаменатель', '(лек) Теория управления 515ю Лукьянов В. В. ']]], [4, [['Оба дня', '(лек) Теория управления 515ю Лукьянов В. В. ']]], [5, [['Оба дня', '(сем) Элективный курс по физической культуре и спорту   ']]]]], [5, [[1, [['Знаменатель', '(лек) Вычислительные средства АСОИУ 524 Спиридонов С. Б. ']]], [2, [['Оба дня', '(лек) Вычислительные средства АСОИУ 524 Спиридонов С. Б. ']]], [3, [['Оба дня', '(лек) Оперативный анализ данных 524 Маслеников К. Ю., Селиверстова А. В. ']]],[4, [['Оба дня', 'лр ВС 1/2 306э']]]]], [6, [[4, [['Оба дня', 'ОАД лр 306э']]],[5, [['Оба дня', 'ОС лр 903']]]]]]]
    elif parametr=="ИУ5-51Б":
        return ['ИУ5-51Б', [[1, [[1, [['Числитель', 'ВС 1/2 306э']]], [4, [['Знаменатель', 'РИП 1/2 306э']]], [5, [['Знаменатель', 'РИП 1/2 306э']]], [6, [['Знаменатель', 'СТ 1/2 306э']]],[7, [['Знаменатель', 'СТ 1/2 306э']]]]], [2, [[5, [['Оба дня', '(сем) Элективный курс по физической культуре и спорту   ']]], [6, [['Оба дня', '(лек) Операционные системы 515ю Семкин П. С. ']]], [7, [['Оба дня', '(лек) Разработка интернет-приложений 515ю Канев А. И. ']]]]], [3, [[1, [['Знаменатель', 'РИП 2/2 306э']]],[2, [['Знаменатель', 'РИП 2/2 306э']]],[3, [['Знаменатель', 'СТ 2/2 306э']]],[5, [['Числитель', 'СТ 2/2 306э']]],[6, [['Числитель', 'ВС 2/2 306э']]],[7, [['Числитель', 'ВС 2/2 306э']]] ]], [4, [[2, [['Оба дня', '(лек) Сети и телекоммуникации 515ю Галкин В. А. ']]], [3, [['Числитель', '(лек) Сети и телекоммуникации 515ю Галкин В. А. '], ['Знаменатель', '(лек) Теория управления 515ю Лукьянов В. В. ']]], [4, [['Оба дня', '(лек) Теория управления 515ю Лукьянов В. В. ']]], [5, [['Оба дня', '(сем) Иностранный язык 235л, 401л  ']]], [6, [['Оба дня', '(сем) Элективный курс по физической культуре и спорту   ']]]]], [5, [[1, [['Знаменатель', '(лек) Вычислительные средства АСОИУ 524 Спиридонов С. Б. ']]], [2, [['Оба дня', '(лек) Вычислительные средства АСОИУ 524 Спиридонов С. Б. ']]], [3, [['Оба дня', '(лек) Оперативный анализ данных 524 Маслеников К. Ю., Селиверстова А. В. ']]],[4, [['Числитель', 'лр ОС 903'],['Знаменатель', 'Пр-ка 903']]],[5, [['Числитель', 'лр ОС 903'],['Знаменатель', 'Пр-ка 903']]]]], [6, [[3, [['Числитель', 'ОАД лр 306э']]],[4, [['Числитель', 'ОАД лр 306э']]]]]]]
    else:
        a=requests.get('https://lks.bmstu.ru/schedule/list')
        b=a.content.decode('utf-8')
        b=b.replace(" ","",b.count(" "))
        b=b.split("\n")
        c=[]
        for i in range(len(b)):
            if 'ahref="' in b[i]:
                d=b[i].split('"')
                c.append([b[i+1],d[1]])
        pras=[]
        for i in range(len(c)):
            if not "<" in c[i][0]:
                if c[i][0]==parametr:
                    a=requests.get('https://lks.bmstu.ru'+c[i][1])
                    b=a.content.decode('utf-8')
                    b=b.split('<div class="col-md-6 d-block d-md-none">')
                    bereta=[]
                    for day in range(len(b)):
                        raspis=b[day].split("<tr>")
                        greta=[]
                        for para in range(len(raspis)):
                            konech=raspis[para].split("\n")
                            paravoz=[]
                            flag=False
                            for i1 in konech:
                                if not '<!--Десктопная версия -->' in i1:
                                    if '<td class="text-info-bold">' in i1:
                                        filt=i1.split('<')
                                        slovo=''
                                        try:
                                            if not "/td>" in filt[2]:
                                                slovo+=filt[2]+" "
                                        except:
                                            pass
                                        try:
                                            if not "/td>" in filt[4]:
                                                slovo+=filt[4]+" "                                
                                        except:
                                            pass
                                        try:
                                            if not "/td>" in filt[6]:
                                                slovo+=filt[6]+" "                                 
                                        except:
                                            pass
                                        try:
                                            if not "/td>" in filt[8]:
                                                slovo+=filt[8]+" "
                                        except:
                                            pass 
    
                                        slovo=slovo.replace("/i>","").replace("i>","").replace("/span>","").replace("span>","")
                                        if len(slovo)!=0:
                                            paravoz.append(["Числитель",slovo])
                                    elif '<td class="text-primary">'  in i1:
                                        filt=i1.split('<')
                                        slovo=''
                                        try:
                                            if not "/td>" in filt[2]:
                                                slovo+=filt[2]+" "
                                        except:
                                            pass
                                        try:
                                            if not "/td>" in filt[4]:
                                                slovo+=filt[4]+" "                                
                                        except:
                                            pass
                                        try:
                                            if not "/td>" in filt[6]:
                                                slovo+=filt[6]+" "                                 
                                        except:
                                            pass
                                        try:
                                            if not "/td>" in filt[8]:
                                                slovo+=filt[8]+" "
                                        except:
                                            pass 
    
                                        slovo=slovo.replace("/i>","").replace("i>","").replace("/span>","").replace("span>","")
                                        if len(slovo)!=0:
                                            paravoz.append(["Знаменатель",slovo]) 
                                    elif '<td colspan="2">'  in i1:
                                        filt=i1.split('<')
                                        slovo=''
                                        try:
                                            if not "/td>" in filt[2]:
                                                slovo+=filt[2]+" "
                                        except:
                                            pass
                                        try:
                                            if not "/td>" in filt[4]:
                                                slovo+=filt[4]+" "                                
                                        except:
                                            pass
                                        try:
                                            if not "/td>" in filt[6]:
                                                slovo+=filt[6]+" "                                 
                                        except:
                                            pass
                                        try:
                                            if not "/td>" in filt[8]:
                                                slovo+=filt[8]+" "
                                        except:
                                            pass 
                                        slovo=slovo.replace("/i>","").replace("i>","").replace("/span>","").replace("span>","")
                                        if len(slovo)!=0:
                                            paravoz.append(["Оба дня",slovo])
                                else:
                                    
                                    flag=True
                                    break
                            if flag:
                                if len(paravoz)!=0:
                                    greta.append([para-1,paravoz])
                                break
                            if len(paravoz)!=0:
                                greta.append([para-1,paravoz])
                        if len(greta)!=0:
                            bereta.append([day,greta])
                    pras+=[c[i][0],bereta]
        print (pras)
        return pras

def user():
    markup = types.InlineKeyboardMarkup()
    a1=types.InlineKeyboardButton('Сегодня',callback_data="Сегодня")
    a2=types.InlineKeyboardButton('Завтра',callback_data="Завтра")
    a3=types.InlineKeyboardButton('📆 Всё расписание',callback_data="📆 Всё расписание")
    a4=types.InlineKeyboardButton('📝 Доп. возможности',callback_data="📝 Доп. возможности")
    markup.add(a1, a2)
    markup.add(a3)
    markup.add(a4)
    return markup
def nazad(name):
    markup = types.InlineKeyboardMarkup()
    a4=types.InlineKeyboardButton('😉Назад😉',callback_data="😉Назад😉")
    a5=types.InlineKeyboardButton('😉Удалить😉',callback_data="😉"+name)
    markup.add(a4)
    markup.add(a5)
    return markup
def nazad1():
    markup = types.InlineKeyboardMarkup()
    a5=types.InlineKeyboardButton('😴Назад😴',callback_data="😴Назад😴")
    markup.add(a5)
    return markup
def soglas(name):
    markup = types.InlineKeyboardMarkup()
    a5=types.InlineKeyboardButton('Да',callback_data=name+"😡")
    a6=types.InlineKeyboardButton('Нет',callback_data="😉Назад😉")
    markup.add(a5)
    markup.add(a6)
    return markup

def settings():
    markup = types.InlineKeyboardMarkup()
    a1=types.InlineKeyboardButton('⏰ Поставить будильник',callback_data="⏰ Поставить будильник")
    a2=types.InlineKeyboardButton('📝 Сделать заметку',callback_data="📝 Сделать заметку")
    a3=types.InlineKeyboardButton('🎓 Изменить кафедру',callback_data="🎓 Изменить кафедру")
    a4=types.InlineKeyboardButton('📝 Мои Заметки',callback_data='📝 Мои заметки')
    a5=types.InlineKeyboardButton('🔙 Назад',callback_data='🔙 Назад')
    markup.add(a2)
    markup.add(a3)
    markup.add(a4)
    markup.add(a5)
    return markup

def pars_day(day, raspis, chis):
    timer=["","08:30 - 10:05","10:15 - 11:50","12:00 - 13:35","13:50 - 15:25","15:40 - 17:15","17:25 - 19:00","19:10 - 20:45"]
    timerFV=["","","10:00 - 11:30","12:20 - 13:25","14:05 - 14:15","15:50 - 17:20"]
    days=["","Понедельник","Вторник","Среда","Четверг","Пятница","Суббота"]
    if day==7:
        return "Воскресенье, отдыхайте"
    else:
        if day==8:
            day=1
            chis=abs(chis-1)
        raspis=raspis[1]
        ras=""
        for i in raspis:
            if i[0]==day:
                ras+=days[day]+"\n"
                for i2 in i[1]:
                    if len(i2[1])>1:
                        for i3 in i2[1]:
                            if chis==0 and i3[0]=="Знаменатель":
                                if "Элективный курс" in i3[1]:
                                    ras+= timerFV[i2[0]]+ "\n"
                                    ras+=i3[1]+"\n"                                    
                                else:
                                    ras+= timer[i2[0]]+ "\n"
                                    ras+=i3[1]+"\n"
                            elif chis==1 and i3[0]=="Числитель":
                                if "Элективный курс" in i3[1]:
                                    ras+= timerFV[i2[0]]+ "\n"
                                    ras+=i3[1]+"\n"                                    
                                else:
                                    ras+= timer[i2[0]]+ "\n"
                                    ras+=i3[1]+"\n"
                    else:
                        if chis==0 and i2[1][0][0]=="Знаменатель":
                            if "Элективный курс" in i2[1][0][1]:        
                                ras+= timerFV[i2[0]]+ "\n"
                                ras+=i2[1][0][1]+ "\n"                                  
                            else:                        
                                ras+= timer[i2[0]]+ "\n"
                                ras+=i2[1][0][1]+ "\n"
                        elif chis==1 and i2[1][0][0]=="Числитель":
                            if "Элективный курс" in i2[1][0][1]:        
                                ras+= timerFV[i2[0]]+ "\n"
                                ras+=i2[1][0][1]+ "\n"                                  
                            else:                        
                                ras+= timer[i2[0]]+ "\n"
                                ras+=i2[1][0][1]+ "\n"
                        elif i2[1][0][0]=="Оба дня":
                            if "Элективный курс" in i2[1][0][1]:        
                                ras+= timerFV[i2[0]]+ "\n"
                                ras+=i2[1][0][1]+ "\n"                                  
                            else:                        
                                ras+= timer[i2[0]]+ "\n"
                                ras+=i2[1][0][1]+ "\n"
        if ras=="":
            ras+=days[day]+"\n"
            ras+="У вас нет пар в этот день"
    return ras
def budil():
        markup = types.InlineKeyboardMarkup()
        a1=types.InlineKeyboardButton("Ввести за сколько оповестить",callback_data="ZADERSCH")    
        a2=types.InlineKeyboardButton("Назад",callback_data="Назад")
        markup.add(a1)
        markup.add(a2)
        return markup

def zaderch():
        markup = types.InlineKeyboardMarkup()
        a1=types.InlineKeyboardButton("Снять будильник",callback_data="SNAT") 
        a2=types.InlineKeyboardButton("Ввести за сколько оповестить",callback_data="ZADERSCH")    
        a3=types.InlineKeyboardButton("Назад",callback_data="Назад")
        markup.add(a1)
        markup.add(a2)
        markup.add(a3)
        return markup

def moi_zametki(telegram_id,dates):
    markup = types.InlineKeyboardMarkup()
    r=dates.split()
    for i in range(len(r)):
        if r[i]!="%^&@#":
            a1=types.InlineKeyboardButton(r[i],callback_data=str(telegram_id)+"#1@3$"+str(i+1))
            markup.add(a1)
    a1=types.InlineKeyboardButton("Назад",callback_data="Назад")
    markup.add(a1)
    return markup
def all_para(raspis):
    timer=["","08:30 - 10:05","10:15 - 11:50","12:00 - 13:35","13:50 - 15:25","15:40 - 17:15","17:25 - 19:00","19:10 - 20:45"]
    days=["","Понедельник","Вторник","Среда","Четверг","Пятница","Суббота"]
    raspis=raspis[1]
    ras=""
    for i in raspis:
        ras+=days[i[0]]+"\n"
        for i2 in i[1]:
            ras+= timer[i2[0]]+ "\n"
            for i3 in i2[1]:
                if i3[0]=="Знаменатель":
                    ras+="Знаменатель:"+" "+i3[1]+"\n"
                elif i3[0]=='Числитель':
                    ras+='Числитель:'+" "+i3[1]+"\n"
                else:
                    ras+=str(i3[1])+"   "

            ras+="\n\n" 
        ras+="__________________________________%#%"
    return ras
    